/* This is a mapping of BRError code failures to localized failure reasons */

/* kBRMediaManagerErrorNoPlayer*/
100 = "選択されたコンテンツは再生できませんでした。";


/* kBRMediaPlayerNoDatabaseFound*/
200 = "コンテンツが見つかりません。";

/* kBRMediaPlayerSongPlaybackError*/
201 = "現在の曲を再生できません。";


/* kBRMediaNoContent*/
300 = "コンテンツが見つかりませんでした。";

/* kBRMediaNoPhotoContent */
301 = "iPhoto ライブラリに写真がありません。";

/* kBRMediaNoPodcastContent */
302 = "iTunes ライブラリに Podcast がありません。";

/* kBRMediaNotDRMAuthorized */
303 = "このコンテンツを再生することが認証されていません。";

/* kBRMediaNoMovieFolderContent */
304 = "“ムービー”フォルダに再生できるムービーがありません。";

/* kBRMediaNoTVShowContent */
305 = "iTunes ライブラリにテレビ番組がありません。";

/* kBRMediaNoMusicVideoContent */
306 = "iTunes ライブラリにミュージックビデオがありません。";

/* kBRMediaNoPlaylists */
307 = "iTunes ライブラリにプレイリストがありません。";

/* kBRMediaNoSongContent */
308 = "iTunes ライブラリに曲がありません。";

/* kBRMediaNoAudioBookContent */
309 = "iTunes ライブラリにオーディオブックがありません。";

/* kBRMediaEmptyPlaylist */
310 = "このプレイリストには曲がありません。";

/* kBRMediaNoSuchPlaylist */
311 = "選択されたプレイリストは見つかりませんでした。";

/* kBRMediaNoSuchSong */
312 = "選択された曲は見つかりませんでした。";

/* kBRMediaNoMovies */
315 = "“ムービー”フォルダにムービーがありません。";

/* kBRMediaNoSongForSlideshow */
316 = "このスライドショーの音楽は再生できませんでした。";

/* kBRMediaSongPlaybackErrorDuringSlideshow */
317 = "このスライドショーの音楽は再生できませんでした。";

/* kBRVideoUnplayable */
318 = "選択されたビデオは再生できません。";

/* kBRMediaRadioStreamUnplayable */
319 = "選択したラジオストリームを再生できませんでした。";

/* kBRRemoteMediaNoContent*/
350 = "このライブラリにはコンテンツが見つかりませんでした。";

/* kBRRemoteMediaNoPhotoContent */
351 = "このライブラリには写真がありません。";

/* kBRRemoteMediaNoPodcastContent */
352 = "このライブラリには Podcast がありません。";

/* kBRRemoteMediaNotDRMAuthorized */
353 = "このコンテンツを再生することが認証されていません。";

/* kBRRemoteMediaNoTVShowContent */
355 = "このライブラリにはテレビ番組がありません。";

/* kBRRemoteMediaNoMusicVideoContent */
356 = "このライブラリにはミュージックビデオがありません。";

/* kBRRemoteMediaNoPlaylists */
357 = "このライブラリにはプレイリストがありません。";

/* kBRRemoteMediaNoSongContent */
358 = "このライブラリには曲がありません。";

/* kBRRemoteMediaNoAudioBookContent */
359 = "このライブラリにはオーディオブックがありません。";

/* kBRRemoteMediaEmptyPlaylist */
360 = "このプレイリストには曲がありません。";

/* kBRRemoteMediaLoadingError */
361 = "このコンテンツを読み込み中にエラーが発生しました。";

/* kBRRemotePhotoSourceUnavailableError */
363 = "写真の共有元が利用できません。";

/* kBRDataSourceInitializationFailure*/
400 = "コンテンツが見つかりませんでした。";

/* kBRDataSourceURLResolutionFailure*/
410 = "コンテンツが見つかりませんでした。";

/* kBRDataSourceConnectionInProgressError */
420 = "すでにこのソースに接続しようとしています。";


/* KBRSystemNetworkHostUnreachable */
501 = "このライブラリに接続できません。";

/* kBRSystemErrorTrailerSiteUnreachable */
502 = "この劇場映画の予告編は現在再生できません。";

/* kBRSystemNotHDCPCompliant */
503 = "このコンテンツを再生するには HDCP が必要です。";

/* kBRSetupCantSetLanguage */
600 = "言語は変更できません。";


/* kBRDVDErrorCantInitializeDVDPlaybackAlert */
750 = "今は DVD の再生はできません。";

/* kBRDVDErrorCantEjectDVDAlert */
751 = "DVD を取り出せません。";

/* kBRDVDErrorBadRegionCodeAlert */
752 = "DVD のリージョンコードが DVD プレーヤーと一致しません。";

/* kBRDVDErrorBadDVDMediaAlert */
753 = "DVD を再生できません。";

/* kBRDVDErrorFatalDVDAlert */
754 = "DVD を再生できません。";

/* kBRCDErrorCantEjectCDAlert */
755 = "CD を取り出せません。";

/*	kDVDErrorAuthentification = -70025,	The user attempting to change the region code could not be authenticated. */
-70025 = "このディスクのコピープロテクションを検証できません。";

/* kBRInternalResourceError */
900 = "エラーが起きました。";

